#include "naive_bayes.h"
#include <iostream>

int main() {
    naive_bayes_model model; // {
        // { "ºÃ¹Ï", {"ÎÚºÚ", "ÉÔòé", "×ÇÏì", "ÇåÎú", "ÉÔ°¼", "Ó²»¬"} },
        // { "ºÃ¹Ï", {"ÎÚºÚ", "ÉÔòé", "×ÇÏì", "ÉÔºı", "ÉÔ°¼", "ÈíÕ³"} },
        // { "ºÃ¹Ï", {"ÇàÂÌ", "ÉÔòé", "×ÇÏì", "ÇåÎú", "ÉÔ°¼", "ÈíÕ³"} },
        // { "ºÃ¹Ï", {"Ç³°×", "òéËõ", "×ÇÏì", "ÇåÎú", "°¼Ïİ", "Ó²»¬"} },
        // { "ºÃ¹Ï", {"Ç³°×", "òéËõ", "×ÇÏì", "ÇåÎú", "°¼Ïİ", "Ó²»¬"} },
        // { "ºÃ¹Ï", {"ÇàÂÌ", "òéËõ", "³ÁÃÆ", "ÇåÎú", "°¼Ïİ", "Ó²»¬"} },
        // { "ºÃ¹Ï", {"ÎÚºÚ", "òéËõ", "×ÇÏì", "ÇåÎú", "°¼Ïİ", "Ó²»¬"} },
        // { "ºÃ¹Ï", {"ÎÚºÚ", "òéËõ", "³ÁÃÆ", "ÇåÎú", "°¼Ïİ", "Ó²»¬"} },
        // { "ºÃ¹Ï", {"ÇàÂÌ", "òéËõ", "×ÇÏì", "ÇåÎú", "°¼Ïİ", "Ó²»¬"} },
        // { "»µ¹Ï", {"ÇàÂÌ", "òéËõ", "³ÁÃÆ", "ÉÔºı", "ÉÔ°¼", "Ó²»¬"} },
        // { "»µ¹Ï", {"Ç³°×", "òéËõ", "×ÇÏì", "Ä£ºı", "Æ½Ì¹", "Ó²»¬"} },
        // { "»µ¹Ï", {"ÎÚºÚ", "ÉÔòé", "×ÇÏì", "ÇåÎú", "ÉÔ°¼", "ÈíÕ³"} },
        // { "»µ¹Ï", {"Ç³°×", "ÉÔòé", "³ÁÃÆ", "ÉÔºı", "°¼Ïİ", "Ó²»¬"} },
        // { "»µ¹Ï", {"ÇàÂÌ", "ÉÔòé", "×ÇÏì", "ÉÔºı", "°¼Ïİ", "Ó²»¬"} },
        // { "»µ¹Ï", {"Ç³°×", "òéËõ", "×ÇÏì", "Ä£ºı", "Æ½Ì¹", "ÈíÕ³"} },
        // { "»µ¹Ï", {"Ç³°×", "Ó²Í¦", "Çå´à", "Ä£ºı", "Æ½Ì¹", "Ó²»¬"} },
        // { "»µ¹Ï", {"ÇàÂÌ", "Ó²Í¦", "Çå´à", "ÇåÎú", "Æ½Ì¹", "ÈíÕ³"} },
        // { "»µ¹Ï", {"ÎÚºÚ", "ÉÔòé", "³ÁÃÆ", "ÉÔºı", "ÉÔ°¼", "Ó²»¬"} }
        // { "×÷Òµ", {"Ï²»¶", "Ã÷Ìì", "ĞÁ¿à"} },
        // { "×÷Òµ", {"Ï²»¶", "ºì¶¹"} },
        // { "×÷Òµ", {"ĞÁ¿à", "Ã÷Ìì"} },
        // { "×÷Òµ", {"Ã÷Ìì"} },
        // { "×÷Òµ", {"ĞÁ¿à", "Ã÷Ìì"} },
        // { "×÷Òµ", {"ĞÁ¿à", "ºì¶¹"} },
        // { "×÷Òµ", {"ĞÁ¿à", "Ï²»¶"} },
        // { "×÷Òµ", {"ĞÁ¿à"} },
        // { "ÇéÊé", {"Ï²»¶", "ºì¶¹", "Ï²»¶", "Ã÷Ìì"} },
        // { "ÇéÊé", {"Ã÷Ìì", "Ï²»¶", "ºì¶¹"} },
        // { "ÇéÊé", {"Ï²»¶", "ºì¶¹", "Ï²»¶", "Ï²»¶"} },
        // { "ÇéÊé", {"Ï²»¶", "Ï²»¶", "ºì¶¹", "Ï²»¶"} },
    // };
    // model.push_data("Normal message", {"Dear", "Friend"});
    // model.push_data("Normal message", {"Dear", "Friend", "Money"});
    // model.push_data("Normal message", {"Dear", "Lunch", });
    // model.push_data("Normal message", {"Dear"});
    // model.push_data("Normal message", {"Dear", "Lunch"});
    // model.push_data("Normal message", {"Friend", "Dear"});
    // model.push_data("Normal message", {"Dear", "Lunch", "Friend"});
    // model.push_data("Normal message", {"Dear", "Friend"});
    // model.push_data("Spam", {"Dear", "Friend"});
    // model.push_data("Spam", {"Dear", "Money"});
    // model.push_data("Spam", {"Money", "Money"});
    // model.push_data("Spam", {"Money"});
    model.push_data("ºÃ¹Ï", {"ÎÚºÚ", "ÉÔòé", "×ÇÏì", "ÇåÎú", "ÉÔ°¼", "Ó²»¬"});
    model.push_data("ºÃ¹Ï", {"ÎÚºÚ", "ÉÔòé", "×ÇÏì", "ÉÔºı", "ÉÔ°¼", "ÈíÕ³"});
    model.push_data("ºÃ¹Ï", {"ÇàÂÌ", "ÉÔòé", "×ÇÏì", "ÇåÎú", "ÉÔ°¼", "ÈíÕ³"});
    model.push_data("ºÃ¹Ï", {"Ç³°×", "òéËõ", "×ÇÏì", "ÇåÎú", "°¼Ïİ", "Ó²»¬"});
    model.push_data("ºÃ¹Ï", {"Ç³°×", "òéËõ", "×ÇÏì", "ÇåÎú", "°¼Ïİ", "Ó²»¬"});
    model.push_data("ºÃ¹Ï", {"ÇàÂÌ", "òéËõ", "³ÁÃÆ", "ÇåÎú", "°¼Ïİ", "Ó²»¬"});
    model.push_data("ºÃ¹Ï", {"ÎÚºÚ", "òéËõ", "×ÇÏì", "ÇåÎú", "°¼Ïİ", "Ó²»¬"});
    model.push_data("ºÃ¹Ï", {"ÎÚºÚ", "òéËõ", "³ÁÃÆ", "ÇåÎú", "°¼Ïİ", "Ó²»¬"});
    model.push_data("ºÃ¹Ï", {"ÇàÂÌ", "òéËõ", "×ÇÏì", "ÇåÎú", "°¼Ïİ", "Ó²»¬"});
    model.push_data("»µ¹Ï", {"ÇàÂÌ", "òéËõ", "³ÁÃÆ", "ÉÔºı", "ÉÔ°¼", "Ó²»¬"});
    model.push_data("»µ¹Ï", {"Ç³°×", "òéËõ", "×ÇÏì", "Ä£ºı", "Æ½Ì¹", "Ó²»¬"});
    model.push_data("»µ¹Ï", {"ÎÚºÚ", "ÉÔòé", "×ÇÏì", "ÇåÎú", "ÉÔ°¼", "ÈíÕ³"});
    model.push_data("»µ¹Ï", {"Ç³°×", "ÉÔòé", "³ÁÃÆ", "ÉÔºı", "°¼Ïİ", "Ó²»¬"});
    model.push_data("»µ¹Ï", {"ÇàÂÌ", "ÉÔòé", "×ÇÏì", "ÉÔºı", "°¼Ïİ", "Ó²»¬"});
    model.push_data("»µ¹Ï", {"Ç³°×", "òéËõ", "×ÇÏì", "Ä£ºı", "Æ½Ì¹", "ÈíÕ³"});
    model.push_data("»µ¹Ï", {"Ç³°×", "Ó²Í¦", "Çå´à", "Ä£ºı", "Æ½Ì¹", "Ó²»¬"});
    model.push_data("»µ¹Ï", {"ÇàÂÌ", "Ó²Í¦", "Çå´à", "ÇåÎú", "Æ½Ì¹", "ÈíÕ³"});
    model.push_data("»µ¹Ï", {"ÎÚºÚ", "ÉÔòé", "³ÁÃÆ", "ÉÔºı", "ÉÔ°¼", "Ó²»¬"});
    
    model.train();
    auto classification = model.predict("ÇàÂÌ ÇåÎú ³ÁÃÆ ×ÇÏì");
    // auto classification = model.predict("Ï²»¶ Ï²»¶ Ï²»¶ ĞÁ¿à");
    // auto classification = model.predict("Dear Friend");
    
    model.print_log();

    // The classification is ºÃ¹Ï
    std::cout << "\nThe classification is " << classification << "\n";
}